var
    A, B, C, G: array[1..3] of real;
    i: integer;

begin
    Write('Введите координаты точки A через пробел: ');
    for i := 1 to 3 do Read(A[i]);
    Write('Введите координаты точки B через пробел: ');
    for i := 1 to 3 do Read(B[i]);
    Write('Введите координаты точки C через пробел: ');
    for i := 1 to 3 do Read(C[i]);
    G[1] := (A[1] + B[1] + C[1]) / 3;
    G[2] := (A[2] + B[2] + C[2]) / 3;
    G[3] := (A[3] + B[3] + C[3]) / 3;
    Write('Координаты центра тяжести треугольника ABC: ', G[1], ' ', G[2], ' ', G[3]);
end.
